backend/LoadTesting.yml
config:
  target: 'http://api.findrapp.ca'
  phases:
    - duration: 10
      arrivalRate: 20
  payload:
      path: "test/500.csv"
      fields:
        - "email"
        - "password"
      skipHeader: true
scenarios:
  - flow:
    - post: 
        url: "/login"
        json:
          email: "{{ email }}"
          password: "{{ password }}"
    - get:
        url: "/user/{{ email }}/connections"      
    - get:
        url: "/user/{{ email }}/chats"
    - get:
        url: "/fetchChatData?from={{ email }}&to={{ email }}&skipCount=0"

  - flow:
    - get:
        url: "/user/{{ email }}/connections"    
    - get:
        url: "/rightSwipe?src={{ email }}&target={{ email }}"
    - get:
        url: "/leftSwipe?src={{ email }}&target={{ email }}"